Repository: smings/last-email-address-validator
Catalog: languages/last-email-address-validator-*.po
Languages: de_de

source: Here you can control whether to accept email addresses from domains, that allow arbritary recipient names. These are domains that allow arbritary recipient names like %1$sdtras657td8giuy23gtf7e3628@catch-all-domain.com%2$s. For whom might this be important? I.e. if you have a website with a free trial, you might want to make it a bit harder for leechers to get an unlimited amount of free accounts. Of course users with their own domains can create an unlimited amount of email accounts, but by not allowing catch-all domains, it makes it harder for them. I use catch-all domains myself and there is generally nothing wrong about it. You'll have to decide for yourself, whether this is important for you or not. Just so you know: %1$seven gmail.com allows any recipient name%2$s. If you set this option to "No", you should also reject email addresses from free email address providers above.
de_de: Hiermit kontrollierst du, ob du Emailadressen von Domains akzeptieren möchtest, die beliebige Empfängernamen akzeptieren. Dies sind sogenannte Catch-All-Domains. Sie akzeptieren zum Beispiel absurde Empfängernamen wie %1$sdtras657td8giuy23gtf7e3628@catch-all-domain.com%2$s. Für wen ist dies wichtig? Wenn du z.B. eine Website mit einem kostenlosen Trial betreibst, machst du es Leechern ein kleines bisschen schwieriger beliebig viele kostenlose Trials von dir zu bekommen. Natürlich kann sich im Prinzip jeder mit der Kontrolle über eine Domain auch beliebig viele Emailkonten einrichten, aber durch das Ablehnen von Catch-All-Domain-Emailadressen machst du es Leechern schwieriger. Ich verwende selber Catch-All-Domains und es ist generell nichts Schlimmes. Du musst selbst entscheiden, ob dies für dich wichtig ist oder nicht. Nur zur Info: %1$sAuch gmail.com erlaubt beliebige Empfängernamen%2$s. Wenn du diese Option auf "Nein" stellst, solltest du auch alle freien Emailadressen-Provider ablehnen. Siehe die Option weiter oben.

source: Control which functions and plugins will get validated by LEAV's algorithm.
de_de: Kontrolliere welche WordPress-Funktionen und -Plugins durch LEAVs Algorithmus validiert werden.

source: WordPress user registration
de_de: WordPress Benutzerregistrierung

source: This validates all registrants email address's that register through WordPress's standard user registration. (%1$sSettings -> General%2$s)
de_de: Validieren der Emailadressen von Benutzern, die sich über die WordPress Standard-Benutzerregistrierung anmelden. (%1$sEinstellungen -> Allgemein%2$s)

source: WordPress's built-in user registration is currently deactivated. (%1$sSettings -> General%2$s)
de_de: Die WordPress Benutzeregistrierung ist derzeit deaktiviert. (%1$sEinstellungen -> Allgemein%2$s)

source: WordPress comments
de_de: WordPress Kommentare

source: This validates all (not logged in) commentator's email address's that comment through WordPress's standard comment functionality. (%1$sSettings -> Discussion%2$s)
de_de: Dies validiert die Emailadressen aller (nicht eingeloggten) Kommentatoren, in WordPress' Standard Kommentarfunktion. (%1$sEinstellungen -> Diskussion%2$s)

source: Validate all WooCommerce email addresses during registration and checkout.
de_de: Validieren der Emailadressen von Benutzern, die ein Benutzeraccount über WooCommerce anlegen oder im Checkout eine Emailadresse eingeben.

source: not found in list of active plugins
de_de: wurde nicht in der Liste der aktivierten Plugins gefunden

source: Validate all Contact Form 7 email address fields.
de_de: Validieren der Emailadressen in Ninja Forms Formularen.

source: Validate all WPForms email address fields.
de_de: Validieren der Emailadressen in Kali Forms Formularen.

source: Validate all Ninja Forms email address fields.
de_de: Validieren der Emailadressen in Ninja Forms Formularen.

source: The names of the fields that will get validated by LEAV must contain "email", "e-mail", "e.mail", "E-Mail"... (case insensitive)
de_de: Die Felder die durch LEAV validiert werden sollen müssen im Namen "email", "e-mail", "e.mail", "E-Mail" etc. (Groß- / Kleinschreibung egal) enthalten.

source: Validate all MC4WP email address fields.
de_de: Validieren der Emailadressen in Mailchimp for WordPress (MC4WP) Formularen.

source: Validate all Formidable Forms email address fields.
de_de: Validieren der Emailadressen in Kali Forms Formularen.

source: Validate all Kali Forms email address fields.
de_de: Validieren der Emailadressen in Kali Forms Formularen.

source: Pingbacks and trackbacks can't be validated because they don't come with an email address, that could be run through our validation process. Therefore %1$spingbacks and trackbacks pose a certain spam risk%2$s. But they are also free marketing. By default we therefore accept them.
de_de: Pingbacks und Trackbacks können nicht validiert werden, da sie über keine Emailadressen verfügen. Deshalb %1$sstellen Pingbacks und Trackbacks ein gewisses Spam-Risiko dar%2$s. Allerdings sind sie auch kostenloses Marketing, weshalb wir empfehlen sie zu akzeptieren. Deshalb sind beide Standardwerte auf 'Ja' gesetzt.

source: Accept pingbacks
de_de: Pingbacks akzeptieren

source: Default:
de_de: Standardwert:

source: Accept trackbacks
de_de: Trackbacks akzeptieren

source: If you want to override the default validation error messages or if you want to translate them without having to go through .po files, you can replace the default validation error messages below. The placeholder texts are the default error messages. Overwrite them to use your custom validation error messages. Delete the field's contents for using the defaults again. In multi-language sites, you will have to do the translations within the .po files that come with the plugin. Of course you can do this with the help of plugins like WPML and others as well.
de_de: Wenn du die Standard Validierungsfehler-Nachrichten überschreiben oder übersetzen willst, kannst du deine benutzerdefinierten Texte hier eintragen. Die als Platzhalter angezeigten Texte sind die Standardwerte. Überschreibe sie einfach mit deinen eigenen Fehlermeldungen. Lösche deine Werte, um wieder die Standardwerte zu verwenden. In Mehrsprachigen Installationen musst du die Übersetzungen auch weiterhin in den zugrunde liegenden .po Files vornehmen. Dies kannst du natürlich auch mit Plugins wie WPML und anderen tun.

source: Email address contains invalid characters error message
de_de: Emailadresse beinhaltet ungültige Zeichen

source: Email address syntax error message
de_de: Emailadress Syntaxfehler Nachricht

source: Email address recipient name catch-all syntax error message
de_de: Emailadress Empfängernamen-Catch-All Fehlermeldung

source: Email domain blacklisted error message
de_de: Emaildomain auf Blacklist Fehlermeldung

source: Email domain is on list of free email address provider domains error message
de_de: Email Domain ist auf der Liste kostenloser Emailadressen-Provider Fehlermeldung

source: Email address is blacklisted error message
de_de: Emailadresse ist auf der Blacklist Fehlermeldung

source: Recipient name is blacklisted error message
de_de: Empfängername Blacklisted Fehlermeldung

source: Recipient name is role-based error message
de_de: Rollen-basierter Empfängername Fehlermeldung

source: No MX (Mail eXchange) server found error message
de_de: Keine Mailserver gefunden Fehlermeldung

source: Email address from disposable email address service error message
de_de: Wegwerf-Emailadressen-Service Fehlermeldung

source: Simulating sending an email failed error message
de_de: Simulierter Emailversand gescheitert Fehlermeldung

source: Catch-all domains not allowed error message
de_de: Catch-All-Domain nicht erlaubt Fehlermeldung

source: General email validation error
de_de: Allgemeiner Emailadress Validierungsfehler

source: We believe that LEAV will provide great value for you for as long as you use it. But after setting it up, you don't have to worry about it anymore. We understand that after having set up LEAV you might want to move the LEAV menu item to a different location in the main menu or move it away from the main menu into the settings menu. Here you can control where to place it. The lower the number for a location, the higher up in the menu the LEAV menu item will be displayed. We allow locations in between 0-999. After changing the values, you'll have to reload the page.
de_de: Wir glauben das LEAV dir einen großen Mehrwert liefern wird, indem es deine Lebenszeit vor Spammern schützt. Aber nach dem initialen Setup, musst du dir keinerlei Gedanken mehr darüber machen. Lass LEAV einfach im Hintergrund alle eingegebenen Emailadressen validieren und deine Datenbestände sauber halten. Wir mögen unser Plugin und sein Logo sehr. Aber wir nehmen uns nicht so wichtig, dass wir dein WordPress Hauptmenü anschließend noch vollgemüllt lassen müssten. Hier kannst du einstellen, ob der LEAV Menüeintrag im Hauptmenü oder im Einstellungs-Menü angezeigt werden soll. Darüber hinaus kannst du auch steuern an welchen Positionen in diesen Menüs der Menüeintrag erscheinen soll. Je kleiner die Zahl für eine Position, desto weiter oben erscheint der Menüpunkt. Wir erlauben Werte zwischen 0-999. Nach einer Änderung dieser Einstellungen musst du diese Seite einmal hart neu laden (hard reload), damit die Änderungen sichtbar werden.

source: Show LEAV menu item in main menu / settings menu
de_de: LEAV Menüpunkt im Hauptmenü / Einstellungs-Menü anzeigen

source: Show in
de_de: Anzeige im

source: main menu &nbsp;&nbsp;or
de_de: Hauptmenü &nbsp;&nbsp;oder

source: settings menu
de_de: Einstellungen Menü

source: LEAV menu item location (main menu)
de_de: LEAV Menüpunkt Position (Hauptmenü)

source: Values in between 0-999 are allowed.
de_de: Es sind Werte zwischen 0-999 erlaubt.

source: 0 = top menu position
de_de: 0 = oberste Menüposition

source: Default:
de_de: Standardwert:

source: LEAV menu item location (settings menu)
de_de: LEAV Menüpunkt Position (Einstellungs-Menü)

source: FAQ - Frequently Asked Questions
de_de: FAQ - H&auml;ufig gestellte Fragen

source: How exactly does LEAV validate email addresses?
de_de: Wie validiert LEAV Emailadressen?

source: %1$s %2$sby %3$ssmings%4$s validates email addresses of the supported WordPress functions and plugins in the following multi-step filter/validation process:
de_de: %1$s %2$sby %3$ssmings%4$s validiert & filtert Emailaddressen von WordPress-Funktionen und -Plugins mit Hilfe des nachfolgend beschriebenen, mehrstufigen Prozesses:

source: Email Address Syntax Validation (always active)
de_de: Emailadress-Syntaxvalidierung (immer aktiv)

source: Checks if the email address is syntactically correct. This acts as a backup check for the plugin's checks. Some plugins only have a frontend based email syntax check. LEAV's implementation is a solid regular expression based server-side check. We wouldn't even need it, but use it for performance reasons to filter out wrong emails without further checking
de_de: Überprüft die Emailadress-Syntax. Dies ist nur ein Backup für die eigentlichen Plugin-Validierungen. Einige Plugins verfügen ausschließlich über Frontend-basierte (HTML5 / JavaScript) Syntaxchecks. Dieser Check wird serverseitig auf Basis von regulären Ausdrücken (Patternmatching) durchgeführt. Wir führen diesen Check ausschließlich zur Performance-Optimierung durch, um falsche Emailadressen ohne weitere, aufwändigere Tests ausfiltern zu können

source: Recipient Name Catch-All Syntax (optional)
de_de: Empfängernamen Catch-All Syntax (optional)

source: - Current setting is %1$s"%2$s"%3$s - %4$sChange settings%5$s
de_de: - die aktuelle Einstellung ist %1$s"%2$s"%3$s - %4$sEinstellungen ändern%5$s

source: Control if you want to filter out email addresses with a recipient name catch-all syntax. For more information what a recipient name catch-all syntax is, please check our FAQ entry below.
de_de: Steuere das Ausfiltern von Emailadressen mit Empfängernamen Carch-All-Syntax. Für mehr Informationen darüber, was Empfängernamen mit Catch-All-Syntax sind, schaue dir unseren FAQ-Eintrag weiter unten an.

source: Filters against the user-defined email domain whitelist (if activated). Use this whitelist to override potential false positives from extensive (wildcard) domain blacklist rules. Whenever an email address gets matches by this whitelist, the domain blacklist check gets skipped. We kindly ask you to %1$sinform us%2$s about wrongfully blacklisted domains, so that we can correct any errors as soon as possible.
de_de: Gegen benutzerdefinierte Email-Domain Whitelist filtern. Diese Whitelist kann dafür verwendet werden, um potenzielle "false Positives" einer extensiven Blacklist zu umgehen. Wann immer eine Emailadresse als von einer der Domains der Whitelist erkannt wird, wird der Email-Domain-Blacklist-Check übersprungen. Wir bitten dich %1$suns darüber zu informieren%2$s, falls wir fälschlicherweise Domains auf die Blacklist gesetzt haben, so dass wir Fehler so schnell wie möglich korrigieren können.

source: Email Address Whitelist (optional)
de_de: Emailadressen Whitelist (optional)

source: Filters against the user-defined email whitelist (if activated) If you need to override specific email addresses that would otherwise get filtered out by the blacklist filters.
de_de: Filtert Emailadressen gegen die Emailadressen-Whitelist (falls aktiviert). Hier kannst du einzelne Emailadressen einpflegen, die ansonsten durch die Blacklists ausgefiltert werden würden.

source: Recipient Name Whitelist (optional)
de_de: Empfängernamen Whitelist (optional)

source: Filters against the user-defined recipient name whitelist (if activated) If you need to override specific recipient names that would otherwise get filtered out by either the user-defined recipient name blacklist or the role-based recipient name blacklist. If a recipient name gets matched by this whitelist, both recipient name blacklist checks get skipped.
de_de: Gegen benutzerdefinierte Empfängernamen-Whitelist filtern (wenn aktiviert) Falls du Empfängernamen zulassen möchtest, die andernfalls durch die benutzerdefinierte oder Rollen-basierte Empfängernamen-Blacklist ausgefiltert werden würden. Wenn ein Empfängername durch diese Liste erkannt wird, werden beide Empfängernamen-Blacklist-Checks übersprungen.

source: Filters against the user-defined email domain blacklist (if activated).
de_de: Emailadressen von Domains der Blacklist ablehnen (wenn aktiviert)

source: Free Email Address Provider Domain Blacklist (optional)
de_de: Kostenlose Emailadressn-Provider Blacklist (optional)

source: Filters against the built-in free email address provider domain blacklist (if activated). This list gets updated with new plugin releases.
de_de: Emailadressen von der Blacklist kostenloser Emailadressen-Provider ablehnen (wenn aktiviert). Diese Liste wird mit durch die Plugin Updates aktualisiert.

source: Email Address Blacklist (optional)
de_de: Emailadressen-Blacklist (optional)

source: Filters against the user-defined email address blacklist (if activated).
de_de: Emailadressen auf der Blacklist ablehnen (wenn aktiviert)

source: Recipient Name Blacklist (optional)
de_de: Empfängernamen Blacklist (optional)

source: Filters against the user-defined recipient name blacklist (if activated).
de_de: Empfängernamen auf der benutzerdefinierten Empfängernamen-Blacklist ausfiltern (wenn aktiviert)

source: Role-Based Recipient Name Blacklist (optional)
de_de: Rollen-basierte Empfängernamen Blacklist (optional)

source: Filters against the built-in role-based recipient name blacklist (if activated).
de_de: Empfängernamen auf der Blacklist ablehnen (wenn aktiviert)

source: DNS MX Server Lookup (always active)
de_de: DNS MX Server Abfrage (immer aktiv)

source: Check if the email address's domain has a DNS entry with MX records (always)
de_de: Überprüfung ob die Domain der Emailadresse einen DNS-Eintrag mit MX Servern hat (MX = Mail eXchange) (immer aktiv)

source: Disposable Email Address (DEA) Service Blacklist (optional)
de_de: Wegwerf-Emailadressen-Service Blacklist (optional)

source: Filters against the built-in extensive blacklist of disposable email services (if activated). This list gets updated with new plugin releases.
de_de: Emailadressen von Domains der Wegwerf-Emailadressen Provider Blacklist ablehnen (wenn aktiviert). Diese Liste wird mit Plugin-Updates aktualisiert.

source: Simulate Email Sending (optional)
de_de: Simulierter Emailversand (optional)

source: Connects to one of the MX servers and simulates the sending of an email from %1$sno-reply@%2$s%3$s to the entered email address. No actual email will be sent out. This is just LEAV asking the receiving server, if it would accept the email address. Then the dialog with the MX server gets terminated without any email being sent. It's essentially like looking at a house's mailboxes and checking if there is a mailbox with a specific name on it and if we can open it and see if the letter would fit in without dropping it into the mailbox.
de_de: Stellt eine Verbindung mit einem der hinterlegten MX-Server her und simuliert das Versenden einer Email von %1$sno-reply@%2$s%3$s an die zu validierenden Emailadresse. Hierbei wird keine Email versendet. LEAV fragt den Mailserver lediglich, ob er eine Email für den Empfängernamen akzeptieren würde. Dann wird der Dialog mit dem MX-Server abgebrochen ohne eine Email zu versenden. Dies ist damit vergleichbar zu einem Haus zu gehen und zu gucken, ob man einen spezifischen Namen an einem der Briefkästen finden kann, ob man den Briefkastenschlitz öffnen kann und den Brief einmal reinzustecken ohne loszulassen, dann aber wieder herauszuziehen.

source: Allow Email Addresses from Catch-All Domains (optional)
de_de: Emailadressen von Catch-All-Domains erlauben (optional)

source: If set to "No", this filters out all email addresses that originate from domains that accept emails for ANY recipient name.
de_de: Wenn dies auf "Nein" gesetzt wird, werden alle Emailadressen von Domains, die beliebige Empfängernamen akzeptieren abgelehnt.

source: Can I use wildcards for the whitelists/blacklists?
de_de: Kann ich WIldcards für die Whitelists/Blacklists verwenden?

source: The short answer is yes and here is how it works
de_de: Die Kurzantwort ist ja und so funktioniert es

source: Wildcard syntax for domains:
de_de: Wildcard-Syntax für Domains:

source: You can use asterisks "%1$s*%2$s" as wildcards in domain names. It stands for zero up to any amount of characters. I.e. "%1$smail4*.com%2$s" matches all emails from domains starting with "%1$smail4%2$s" followed any number of characters and ending in "%1$s.com%2$s". In this example "%1$smail4.com%2$s", "%1$smail4i.com%2$s", "%1$smail4me.com%2$s", "%1$smail4myparents.com%2$s" would all be matched. You can use "*" for entire subdomains and top-level domains (TLDs) (Explanation: subdomain2.subdomain1.domain.tld). "%1$s*.mail.*%2$s" matches "%1$sa.mail.tk%2$s" or "%1$sthis-is-a-subdomain.mail.com%2$s". If you want to block entire top-level-domains, you'll have to use "%1$s**%2$s" as domain name. I.e. "%1$s**.tk%2$s" will match all domains ending with "%1$s.tk%2$s". You can see further examples on our list of free email address provider domains in the blacklists section.
de_de: Du kannst Sternchen "%1$s*%2$s" als Platzhalter (Wildcards) verwenden. Das Sternchen steht für 0 bis beliebig viele Zeichen. Zum Beispiel "%1$smail4*.com%2$s" erkennt alle Domains die mit "%1$smail4%2$s" beginnen gefolgt von keinem oder beliebig vielen Zeichen gefolgt von einem abschließenden "%1$s.com%2$s". In diesem Beispiel würden"%1$smail4.com%2$s", "%1$smail4i.com%2$s", "%1$smail4me.com%2$s", "%1$smail4myparents.com%2$s" allesamt erkannt werden. Du kannst ein Sternchen "*" auch für gesamte Subdomains oder Top-Level-Domains (tld) verwenden. (Hier ein Beispiel was eine Subdomain und eine Top-Level-Domain sind: subdomain.domain.tld). "%1$s*.mail.*%2$s" erkennt "%1$sa.mail.tk%2$s" oder auch "%1$sthis-is-a-subdomain.mail.com%2$s". Wenn du eine gesamte Top-Level-Domain filtern willst, musst du für die Domain doppelte Sternchen "%1$s**%2$s" eintragen. Zum Beispiel "%1$s**.tk%2$s" erkennt sämtliche Domains der Top-Level-Domain "%1$s.tk%2$s". Beispiele hierfür kannst du auch in der Blacklist der kostenlosen Emailadressen-Provider sehen.

source: Be careful to not over do any kind of matching with wildcards. We urge you to extensively test whether email addresses would get matched or not with the test option %1$sat the very top%2$s of the settings page.
de_de: Halte dich mit den Platzhaltern (Wildcards) nach Möglichkeit zurück. Unsere Erfahrung zeigt, dass man es hier schnell übertreiben kann. Bitte teste deine Einstellungen und Filter intensiv, damit du deine gewünschten Ergebnisse erzielst. Hierfür gibt es %1$sganz oben auf dieser Seite eine Testmöglichkeit%2$s.

source: Wildcard syntax for recipient names:
de_de: Platzhalter-Syntax für Empfängernamen:

source: You can use asterisks "%1$s*%2$s" as wildcards in recipient names as well. It stands for zero up to any amount of characters. I.e. "%1$s*spammer*%2$s" matches all recipient names containing the word "%1$sspammer%2$s". It matches "%1$sall-spammers-go%2$s" or just "%1$sspammer%2$s". %1$smailfrom*%2$s" matches all recipient names starting with "%1$smailfrom%2$s". I.e. "%1$smailfrom%2$s", "%1$smailfroma%2$s", "%1$smailfromme%2$s", etc. You can place the asterisk anywhere. I.e. "%1$s*spam*from*%2$s" matches "%1$sspamfrom%2$s" as well as "%1$sall-spam-from-me%2$s". You can see plenty examples on our list of role-based recipient names in the blacklists section. These are mostly trailing "*", so that we don't match too many recipient names.
de_de: Auch in Empfängernamen kannst du Sternchen "%1$s*%2$s" als Platzhalter (Wildcards) verwenden. Das Sternchen steht für 0 bis beliebig viele Zeichen. Zum Beispiel erkennt "%1$s*spammer*%2$s" sämtliche Empfängernamen, die das Wort "%1$sspammer%2$s" beinhalten. Es erkennt "%1$sall-spammers-go%2$s" genauso wie "%1$sspammer%2$s". %1$smailfrom*%2$s" erkennt alle Empfängernamen, die mit "%1$smailfrom%2$s" beginnen. Zum Beispiel "%1$smailfrom%2$s", "%1$smailfroma%2$s", "%1$smailfromme%2$s" etc.. Du kannst das Sternchen an einer beliebigen Stelle und beliebig häufig platzieren. "%1$s*spam*from*%2$s" erkennt "%1$sspamfrom%2$s" als auch "%1$sall-spam-from-me%2$s". Du kannst dir viele Beispiele auf der Rollen-basierten Empfängernamen-Blacklist anschauen. Diese beinhaltet überwiegend Beispiele, die ein Sternchen am Ende haben. Dies ist der Fall, damit nicht zu viele Empfängernamen pauschal ausgefiltert werden (zur Vermeidung von "False Positives").

source: Wildcard syntax for email address:
de_de: Platzhalter-Syntax für Emailadressen:

source: Wildcards are NOT available for email addresses as of now. If there is a real usecase for this, feel free to send us a %1$sfeature request%2$s.
de_de: Platzhalter (Wildcards) für Emailadress-Filter erscheinen uns nicht sinnvoll zu sein. Entweder du filterst anhand von Domain-Mustern oder Empfängernamen oder beiden. Zusätzliche Platzhalter für Emailadressen erscheinen uns deshalb überflüssig zu sein. Dies ist eher ein Feature, um Emailadressen sehr gezielt ausschließen zu können. Falls du einen realistischen Anwendungsfall für Platzhalter in Emailadress-Filterlisten hast, stelle bitte einen %1$sFeature Request%2$s.

source: What are the different parts of an email address:
de_de: Was sind die unterschiedlichen Teile einer Emailadresse:
