Repository: smings/last-email-address-validator
Catalog: languages/last-email-validator-*.po
Languages: de_de

source: This email domain is not accepted/valid. Try another one.
de_de: Diese Email-Domain wird nicht akzeptiert/ist ungültig. Versuche eine andere.

source: Anti spam protected by
de_de: Anti-Spam geschützt durch

source: Spam email addresses blocked
de_de: Anzahl geblockter Spam Emailadressen

source: Last Email Validator (LEV) options updated
de_de: Last Email Validator (LEV) Optionen wurden geupdated

source: Last Email Validator (LEV) disposable email services domain blacklist restored
de_de: Last Email Validator (LEV) Einmal-Emailadress-Service-Domain Blacklist wiederhergestellt

source: Dismiss this notice
de_de: Hinweis ausblenden

source: Settings for <strong>Last Email Validator (LEV)</strong> <i>by smings</i>
de_de: Einstellungen für <strong>Last Email Validator (LEV)</strong> <i>by smings</i>

source: Last Email Validator (LEV) validates email addresses of various WordPress functions and plugins in the following ways
de_de: Last Email Validator (LEV) validiert / überprüft Emailaddressen von WordPress-Funktionen und -Plugins auf die folgende Art

source: Check if the email address is syntactically correct (always)
de_de: Überprüfung der syntaktischen Korrektheit der Emailaddresse (immer)

source: Filter against user-defined domain blacklist (if activated)
de_de: Ausfiltern von Emailadressen von Domains auf der Benutzer-definierten Blacklist (wenn aktiviert)

source: Filter against LEV's built-in extensive blacklist of disposable email service domains (if activated)
de_de: Ausfiltern von Emailadressen von Domains auf LEVs Einmal-Email-Service-Anbieter-Domains (wenn aktiviert)

source: Check if the email address's domain has a DNS entry with MX records (always)
de_de: Überprüfung ob die Domain der Emailadresse einen DNS-Eintrag mit MX Servern hat (MX = Mail eXchange) (immer)

source: Connect to one of the MX servers and simulate the sending of an email from <strong>no-reply@
de_de: Verbindung mit einem MX-Server herstellen und das Versenden einer Email von <strong>no-reply@

source: </strong> to the entered email address (always)
de_de: </strong> an die eingegebene (zu überprüfende) Emailaddresse simulieren (immer)

source: Below you can control in which way the selected WordPress functions and plugins will validate entered email adresses.
de_de: Kontrolliere welche WordPress-Funktionen und -Plugins durch LEV Emailaddress-geprüft werden sollen.

source: Email domain for simulating sending of emails to entered email addresses
de_de: Email-Domain für das simulierte Versenden von Emails an die zu überprüfenden Emailadressen

source: </strong> to the entered email address, that gets validated
de_de: </strong an die zu überprüfende Emailaddresse

source: Email domain used for simulating the sending of an email from
de_de: Email-Domain für das simulierte Versenden von Emails von

source: Reject email adresses from user-defined blacklist
de_de: Emailadressen von Domains der benutzerdefinierten Blacklist ablehnen

source: Yes
de_de: Ja

source: No
de_de: Nein

source: Email addresses from the domains on this blacklist will be rejected (if active). <br/><strong>Use one domain per line</strong>.<br/><strong>Default: Yes</strong>
de_de: Emailadressen von Domains der benutzerdefinierten Blacklist abgelehnen. <strong>Nur eine Domain je Zeile eintragen</strong>.<br/><strong>Standardwert: Ja</strong>

source: User-defined blacklisted email domains
de_de: Benutzerdefinierte Domain-Blacklist

source: Reject email adresses from LEV's comprehensive and frequently updated list of disposable email services
de_de: Emailadressen von Domains auf unserer umfassenden und regelmäßig geupdateten Wegwerf- bzw. Einmal-Emailadress-Service-Domain Blacklist ablehnen

source: The listed domains are known services that provide disposable email addresses. Users that make use of these services might just want to protect their own privacy. But they might also be spammers. There is no good choice. In doubt we encourage you to value your lifetime and reject email addresses from these domains. We frequently update this list. For retrieving updates, click the update button below. For blocking domains of your own choosing, use the user-defined blacklist option above.<br/><strong>Default: Yes</strong>
de_de: Die aufgelisteten Domains sind aktuell bekannte Anbieter von Einmal-Emailadress-Services (Wegwerf- oder 10-Minuten-Emailadressen). Benutzer, die Emailadressen dieser Domains nutzen, könnten einfach nur hohen Wert auf ihre Privatssphäre legen. Es könnten jedoch auch Spammer sein. Hierbei gibt es keine gute Wahl. Im Zweifelsfall empfehlen wir dir deine Zeit als wertvoller zu betrachten und Emailadressen von diesen Domains abzulehnen. Du kannst den Button unterhalb jederzeit klicken, um das letzte Update der Blacklist zu erhalten.<br/><strong>Standardwert: Ja</strong>

source: Entries
de_de: Einträge

source: Update list
de_de: Liste aktualisieren

source: Accept syntactically correct email addresses on connection errors
de_de: Syntaktisch korrekte Emailadressen akzeptieren im Falle von Verbindungsfehlern akzeptieren

source: In order to thoroughly validate email addresses, LEV tries to connect to at <br/>least one of the MX (Mail eXchange) servers in the email domain's DNS record. <br/>Usually there are ≥2 MX servers. When this option is set to 'Yes', <br/>the failure to connect to any of the MX servers will be ignored and <br/>syntactically correct email addresses will be accepted.<br/>We do not recommend this, since it will result in more spam. <br/><strong>Default: No</strong>
de_de: Zur gründlichen Überprüfung von Emailadressen probiert LEV eine Verbingung zu mindestens einem der im DNS Eintrag der Emaildomain hinterlegten MX (Mail eXchange) Servern herzustellen. Normalerweise verfügt jede Domain über ≥2 MX server. Wenn die Option auf 'Ja' gesetzt wird, wird ein Scheitern des Verbindungsaufbaus zu mindestens einem MX Server ignoriert und syntaktisch korrekte Emailadressen werden akzeptiert. Wir raten davon ab diese Option zu nutzen, da es zu mehr Spam führt.<br/><strong>Standardwert: Nein</strong>

source: Accepting pingbacks / trackbacks without validation
de_de: Pingbacks / Trackbacks ohne Validierung akzeptieren

source: Pingbacks and trackbacks can't be validated because they don't come with an email address, that could be run through our validator.</br>Therefore <strong>pingbacks and trackbacks pose a certain spam risk</strong>. They are also free marketing.<br/>By default we therefore accept them. But feel free to reject them.
de_de: Pingbacks und Trackbacks können nicht validiert werden, da sie über keine Emailadressen verfügen. Deshalb <strong>stellen Pingbacks und Trackbacks ein gewisses Spam-Risiko dar</strong>. Allerdings sind sie auch kostenloses Marketing, weshalb wir empfehlen sie zu akzeptieren. Deshalb sind die Standardwerte auf 'Ja' gesetzt. Du kannst dies natürlich jederzeit ändern.

source: Accept pingbacks
de_de: Pingbacks akzeptieren

source: Default:
de_de: Standardwert:

source: Accept trackbacks
de_de: Trackbacks akzeptieren

source: Control which of WordPress's functions and plugins should be email validated by LEV
de_de: Kontrolliere welche WordPress-Funktionen und -Plugins durch LEV Emailaddress-geprüft werden sollen

source: Last Email Validator (LEV) is currently capable of validating the email<br/>addresses for the following WordPress features and plugins (if installed and activated): <br/><ol><li>WordPress user registration (<a href="/wp-admin/options-general.php" target="_blank" target="_blank">Settings -> General</a>)</li><li>WordPress comments (<a href="/wp-admin/options-discussion.php" target="_blank">Settings -> Discussion)</li><li><a href="https://wordpress.org/plugins/woocommerce/" target="_blank"> WooCommerce (plugin)</a></li><li><a href="https://wordpress.org/plugins/contact-form-7/" target="_blank">Contact Form 7 (plugin)</a></li></ol></br>
de_de: Last Email Validator (LEV) kann aktuell die Emailaddressen der folgenden <br/>WordPress-Features und -Plugins (wenn installiert und aktiviert) <br/>überprüfen:<br/><ol><li>WordPress Benuzterregistrierung (<a href="/wp-admin/options-general.php" target="_blank">Einstellungen -> Allgemein -> Mitgliedschaft</a>)</a></li><li>WordPress Kommentare (<a href="/wp-admin/options-discussion.php" target="_blank">Einstellungen -> Diskussion</a>)</li><li><a href="https://wordpress.org/plugins/woocommerce/" target="_blank">WooCommerce (plugin)</a></li><li><a href="https://wordpress.org/plugins/contact-form-7/" target="_blank">Contact Form 7 (plugin)</a></li></ol></br>

source: 1. Validate WordPress user registration
de_de: 1. WordPress Benutzerregistrierung validieren

source: This validates all registrants email address's that register through WordPress's standard user registration.<br/><strong>Default: Yes</strong>
de_de: Diese Einstellung steuert die Validierung der Emailadressen von Benutzern, die sich über die WordPress Standard-Benutzerregistrierung anmelden<br/><strong>Standardwert: Ja</strong>

source: 2. Validate WordPress comments
de_de: 2. WordPress Kommentare validieren

source: This validates all commentor email address's that comment through WordPress's standard comment functionality.<br/><strong>Default: Yes</strong>
de_de: Diese Einstellung steuert die Validierung der Emailadressen, die von Benutzern beim Kommentieren angegeben werden müssen.<br/><strong>Standardwert: Ja</strong>

source: 3. Validate WooCommerce (plugin)
de_de: 3. WooCommerce validieren (Plugin)

source: Validate all WooCommerce email addresses during registration and checkout.<br/><strong>Default: Yes</strong>
de_de: Diese Einstellung steuert die Validierung der Emailadressen von Benutzern, die ein Benutzeraccount über WooCommerce anlegen oderim Checkout eine Emailadresse eingeben<br/><strong>Standardwert: Ja</strong>

source: 4. Validate Contact Form 7 (plugin)
de_de: 4. Contact Form 7 validieren (Plugin)

source: Validate all Contact Form 7 email address fields.<br/><strong>Default: Yes</strong>
de_de: Diese Einstellung steuert die Validierung der Emailadressen von Benutzern, die sich über die WordPress Standard-Benutzerregistrierung anmelden<br/><strong>Standardwert: Ja</strong>

source: Leave blank to use Windows default gateway
de_de: Für Windows-Standard-Gateway leer lassen

source: Save Changes
de_de: Änderungen speichern

source: <h1>Feature Requests</h1>If you look for more plugins, we at <a href="https://smings.com" target="_blank">smings.com</a> (website will soon be online) are always happy to make<br/> Last Email Validator (LEV) better than it is and help you. Just shoot us an email to <br/><a href="mailto:lev-feature-requests@smings.com">lev-feature-requests@smings.com</a>.<br/><br/><h1>Help us help you!</h1>Lastly - if Last Email Validator (LEV) delivers substancial value to you, i.e. saving<br/> lots of your precious non-renewable lifetime, because it filters out tons of <br/>spam attempts, please show us your appreciation and consider a one-time donation
de_de: <h1>Feature Requests</h1>Falls du hier dein Plugin vermisst, dann schreib uns eine Email an<br/><a href="mailto:lev-feature-requests@smings.com">lev-feature-requests@smings.com</a>. Wir bei <a href="https://smings.com" target="_blank">smings.com</a> <br/>(die Website geht bald online) wollen Last Email Validator (LEV) immer besser<br/> machen, um deine wertvolle, nicht erneuerbare Lebenszeit zu schützen. Spam ist das letzte, womit Du <br/>sie verschwenden solltest.<h1>Hilf uns dir zu helfen</h1>Wenn Last Email Validator dein Leben bereichert, indem es massenhaft<br/>Spam für dich ausfiltert, dann zeige uns deine Wertschätzung mit einer<br/>Einmal-Spende

source: or become a patreon on our patreon page at
de_de: oder werde ein Patreon auf unserer Patreon-Seite

source: Statistics
de_de: Statistik

source: Spam attacks fended
de_de: Spamversuche abgewehrt

source: Documentation
de_de: Dokumentation

source: Bugs
de_de: Fehler (Bugs)
