Repository: smings/last-email-address-validator
Catalog: languages/last-email-address-validator-*.po
Languages: de_de

source: LEAV provides email address validation and disposable email address blocking for WP registration/comments, WooCommerce, Contact Form 7, WPForms, Ninja Forms, MC4WP, Formidable Forms, Kali Forms and many more plugins to come...
de_de: LEAV liefert Email-Validierung und blockt Wegwerf-Emailadressen für die WP-Registrierung / Kommentarfunktion, WooCommerce, Contact Form 7, WPForms, Ninja Forms, MC4WP, Formidable Forms, Kali Forms und bald noch viel mehr Plugins...

source: The entered email address contains invalid characters.
de_de: Die eingegebene Emailadresse beinhaltet ungültige Zeichen.

source: The entered email address is blacklisted.
de_de: Die eingegebene Emailadresse ist geblockt.

source: The entered email address syntax is invalid.
de_de: Die Syntax der eingegebene Emailadresse ist ungültig.

source: The entered email address's domain doesn't have any mail servers.
de_de: Die Domain der eingegebenen Emailadresse hat keine Mailserver.

source: The entered email address's domain is blacklisted.
de_de: Die Domain der eingegebenen Emailadresse ist geblockt.

source: We don't accept email addresses from disposable email address services (DEA). Please use a regular email address.
de_de: Wir akzeptieren keine Emailadressen von Wegwerf-Emaildiensten. Bitte verwende eine reguläre Emailadresse.

source: We don't accept email addresses from free email address providers. Please use a business email address.
de_de: Wir akzeptieren keine Emailadressen von kostenlosen Emaildiensten. Bitte verwende eine Geschäfts-Emailadresse.

source: We don't accept email addresses from catch-all domains. Your email address's domain accepts any recipient name. Please use an email address from another domain
de_de: Wir akzeptieren keine Emailadressen von Catch-All-Domains. Bitte verwende eine Emailadresse von einer anderen Domain, die nicht beliebige Empfängernamen akzeptiert

source: The entered email address is invalid.
de_de: Die eingegebene Emailadresse ist ungültig.

source: We don't allow recipient names with an inline catch-all syntax using a "+" sign. Please remove the "+" sign and everything after it.
de_de: Wir erlauben keine Empfängernamen mit "Catch-All" Syntax mit "+" Zeichen. Bitte entferne das "+" Zeichen und alles danach.

source: The recipient name (the part before the "@" sign) is blacklisted. Please use another recipient name.
de_de: Der Empfängername (der Teil der Emailadresse vor dem "@" Zeichen) ist geblockt. Bitte verwende einen anderen Empfängernamen / eine andere Emailadresse.

source: We don't allow role-based / generic recipient names in email addresses. Please use a personalized email address.
de_de: Wir akzeptieren keine Rollen-basierten Empfängernamen. Bitte verwende eine persönliche Emailadresse.

source: The entered email address got rejected while trying to send an email to it.
de_de: Die eingegebene Emailadresse wird vom Mailserver abgelehnt.

source: LEAV - Last Email Address Validator could not automatically detect your email domain. This usually only happens in development or staging environments. Please go to %1$sLEAV's settings%2$s page and enter an email domain under which your WordPress instance is reachable.
de_de: LEAV - Last Email Address Validator konnte eine Email Domain nicht automatisch erkennen. Dies passiert fast ausschließlich in Entwicklungs- und Testumgebungen. Bitte gehe in %1$sLEAVs Einstellungen%2$s und gib eine Email Domain ein unter der deine WordPress-Instanz erreichbar ist.

source: Dismiss this notice
de_de: Hinweis ausblenden

source: Could not automatically determine the email domain for simulated sending of emails. %1$sPlease enter your email domain below%3$s or %2$sdeactivate the simulated email sending%3$s to permanently dismiss this warning message.
de_de: Die Email Domain für das simulierte Versenden von Emails konnte nicht automatisch erkannt werden. Bitte gib unten eine %1$sEmail Domain%3$s ein oder %2$sdeaktiviere den simulierten Versand von Emails%3$s, um diesen Warnhinweis dauerhaft auszublenden.

source: Settings
de_de: Einstellungen

source: Quick Navigation
de_de: Schnellnavigation

source: Test Email Address Vaildation
de_de: Emailadressen-Validierungstest

source: Recipient Name Catch All
de_de: Empfängernamen-Catch-All

source: Disposable Email Address Blocking
de_de: Wegwerf-Emailaddress-Blocking

source: Simulate Email Sending
de_de: Simulierter Emailversand

source: LEAV-validated Functions / Plugins
de_de: Durch LEAV validierte Funktionen / Plugins

source: Custom Error Messages
de_de: Benutzerdefinierte Fehlermeldungen

source: LEAV Menu Item Location
de_de: LEAV Menüeintrag Position

source: Help Us, Help You
de_de: Hilf' uns Dir zu helfen

source: Statistics / Version
de_de: Statistik / Version

source: Test Current Email Address Validation Settings
de_de: Test aktueller Emailadress-Validierungs Einstellungen

source: Email address to test
de_de: Emailadresse testen

source: email.address.to@test.com
de_de: email.adresse.zum@testen.de

source: Validation result for email address
de_de: Validierungsergebnis für die Emailadresse

source: is negative!
de_de: ist negativ!

source: ERROR TYPE:
de_de: FEHLER TYP:

source: ERROR MESSAGE:
de_de: FEHLER NACHRICHT:

source: Validation result for email address
de_de: Validierungsergebnis für die Emailadresse

source: is positive!
de_de: ist positiv!

source: The email address got successfully validated. It is good to go!
de_de: Die Emailadresse wurde erfolgreich validiert und wird akzeptiert!

source: Test any email address against LEAV's current settings. No emails will be sent out or saved anywhere. Feel free to adjust the settings to your individual needs. We encourage you to do thorough testing.
de_de: Teste beliebige Emailadressen gegen LEAVs aktuelle Einstellungen. Es werden keinerlei Emails versendet oder gespeichert. Passe die Einstellungen solange an, bis deine Anforderungen erfüllt sind. Wir raten dir dazu intensiv zu testen.

source: Test Email Address
de_de: Teste Emailadresse

source: Email domain for simulated email sending to entered email addresses
de_de: Email-Domain für das simulierte Versenden von Emails an die zu überprüfenden Emailadressen

source: your-wp-email-domain.com
de_de: deine-wp-email-domain.de

source: The Email domain is used for simulating the sending of an email from "no-reply@
de_de: Die Email-Domain wird für das simulierte Versenden von Emails von "no-reply@

source: to the entered email address, that gets validated.
de_de: an die zu validierende Emailadresse verwendet.

source: Please make sure you enter the email domain that you use for sending emails from your WordPress instance. If the email domain doesn't point to your WordPress instance's IP address, simulating the sending of emails might fail. This is usually only the case in development or test environments.
de_de: Bitte trage die Email-Domain ein, mit der du emails von deiner WordPress-Instanz aus versendest. Wenn der DNS-Eintrag der Email-Domain nicht auf die IP deiner WordPress-Instanz zeigt, kann das simulierte Versenden von Emails scheitern. Dies ist meisten nur der Fall in Entwicklungs- und Testumgebungen.

source: In this case you might have to disable the %1$ssimulated email sending%2$s.
de_de: Falls dies der Fall ist, musst du eventuell den %1$ssimulierten Emailversand%2$s deaktivieren.

source: Default: Automatically detected WordPress Domain.
de_de: Standardwert: Automatisch identifizierte WordPress Domain.

source: Save Changes
de_de: Änderungen speichern

source: Filter Function Settings
de_de: Filterfunktions-Einstellungen

source: From here onwards you can configure the filter/validation steps. You can find an overview and description of the filter/validation steps in
de_de: Von hier an kannst du die einzelnen Validierungs-/Filterstufen einstellen. Du findest eine Übersicht aller Filterschritte in

source: our FAQ
de_de: unseren FAQs

source: Recipient Name Catch-All Syntax
de_de: Empfängernamen Catch-All Syntax

source: Allow recipient name catch-all syntax
de_de: Erlaube Empfängernamen Catch-All Syntax

source: Yes
de_de: Ja

source: No
de_de: Nein

source: Allow recipient name (the part of an email address before the "@") catch-all syntax. google and other email address providers allow you to extend the recipient name part of an email address with a "+" followed by whatever text. The only limitation is a maximum length of 64 characters for the recipient name.
de_de: Hier kannst du steuern, ob du Empfängernamen (der Teil der Email vor dem "@"-Zeichen) mit einer Catch-All-Syntax erlauben willst. google und andere Emailadressen-Provider erlauben es den Empfängernamen eines Postfachs mit Hilfe eines angehängten "+"-Zeichens um nachfolgend beliebigen Zeichen zu erweitern. Die einzige Limitierung ist eine maximale Länge von 64 Zeichen für den Empfängernamen einer Emailadresse.

source: "my.name+anything@gmail.com"
de_de: "mein.name+irgendetwas@gmail.com"

source: is the same as
de_de: ist das gleiche wie

source: "my.name@gmail.com"
de_de: "mein.name@gmail.com"

source: for google. This allows users to "cloak" their "main" email address, which is usually used to differentiate where and what the user signed up for. You can choose to allow this or block such email addresses.
de_de: für google. Dies erlaubt Benutzern ihre "Hauptemailadresse" zu "verschleiern". Dies wird üblicherweise dazu verwendet, zwischen Registrierungen für unterschiedliche Websites oder Newsletter zu unterscheiden. Du kannst wählen, ob du diese Art Emailadressen zulassen möchtest oder nicht.

source: Default: Yes
de_de: Standardwert: Ja

source: Any email address that gets whitelisted will skip the corresponding blacklist filter. This doesn't mean that it doesn't get filtered out by other filters. I.e. if a domain gets whitelisted, but at the same time it is a catch-all domain and you disallow catch-all domains, all email addresses from this domain will still get rejected. Look at our %1$sFAQ%2$s for detailed information on how the filter/validation process works.
de_de: Emailadressen, die mit Hilfe eines Whitelist-Filters erkannt werden überspringen stets den korrespondierenden Blacklist-Filter. Dies heißt jedoch nicht automatisch, dass die Emailadresse nicht doch noch durch einen späteren Validierungsschritt ausgefiltert wird. Wenn zum Beispiel eine Domain whitegelistet wird, dann kann sie dennoch durch den Catch-All-Domainfilter später ausgefiltert werden. Schau dir %1$sunsere FAQs%2$s für einen detaillierten Überblick der Filter- und Validierungsschritte an.

source: Use Domain Whitelist
de_de: Domain Whitelist verwenden

source: Email addresses from the listed domains will be accepted without further domain blacklist checks (if active).
de_de: Emailadressen von Domains der benutzerdefinierten Whitelist überspringen den Domain-Blacklist-Filterschritt (wenn aktiviert).

source: For information on how to use wildcards, see our %1$sFAQ entry%2$s.
de_de: Für die Verwendung und Syntax von Wildcards, schau dir unseren %1$sFAQ Eintrag%2$s an.

source: Enter one domain per line.
de_de: Bitte trage eine Domain pro Zeile ein.

source: Default: No
de_de: Standardwert: Nein

source: your-whitelisted-domain-1.com your-whitelisted-domain-2.com
de_de: deine-akzeptierte-domain-1.com deine-akzeptierte-domain-2.com

source: Number of entries:
de_de: Anzahl Einträge:

source: Use email address whitelist
de_de: Emailadressen Whitelist verwenden

source: Email addresses on this list will be accepted without further email address blacklist checks (if active). Unlike with domains and recipient names, you can't use wildcards for email addresses.
de_de: Emailadressen auf dieser Liste überspringen einige Blacklist Filterschritte (wenn aktiviert). Anders als bei Domains und Empfängernamen kannst du hierbei keine Wildcards verwenden.

source: Enter one email address per line.
de_de: Bitte trage eine Emailadresse pro Zeile ein.

source: your.whitelisted@email-address-1.com your.whitelisted@email-address-2.com
de_de: deine.akzeptierte@email-adresse-1.com deine.akzeptierte@email-adresse-2.com

source: Use recipient name whitelist
de_de: Empfängernamen Whitelist verwenden

source: Recipient names on this list will be accepted without further recipient name blacklist checks, either user-defined and/or role-based (if active). Entered recipient names will automatically be stripped of any non-letter (a-z) characters except for wildcards. For information on how to use wildcards, see our %1$sFAQ entry%2$s.
de_de: Empfängernamen auf dieser Liste überspringen die Empfängernamen-Blacklist-Filterungen. Dies betrifft sowohl die benutzerdefinierte als auch die Rollen-basierte Empfängernamenfilterung (wenn aktiviert). Für die Verwendung und Syntax von Wildcards, schau dir unseren %1$sFAQ Eintrag%2$s an.

source: Enter one recipient name per line.
de_de: Trage einen Empfängernamen pro Zeile ein.

source: your-whitelisted-recipient-name-1 your-whitelisted-recipient-name-2
de_de: dein-akzeptierter-empfaenger-name-1 dein-akzeptierter-empfaenger-name-2

source: Any email address that gets matched by a blacklist rule gets rejected, unless it has previously been whitelisted for the blacklist rule. If an email address gets matched by a blacklist rule, all subsequent validations get skipped.
de_de: Emailaddressen, die von Blacklists erkannt werden, werden abgelehnt, es sei denn sie wurden vorher von einer Whitelist-Regel erkannt. Wenn eine Emailadresse von einer Blacklist-Regel erkannt wird, werden alle nachfolgenden Tests abgebrochen.

source: Use domain blacklist
de_de: Domain Blacklist verwenden

source: Email addresses from these domains will be rejected (if active). For information on how to use wildcards, see our %1$sFAQ entry%2$s.
de_de: Emailadressen von Domains der benutzerdefinierten Blacklist werden abelehnt (wenn aktiv). Für weiterführende Informationen zur Nutzung von Wildcards siehe unseren %1$sFAQ Eintrag%2$s.

source: your-blacklisted-domain-1.com your-blacklisted-domain-2.com
de_de: deine-geblockte-domain-1.com deine-geblockte-domain-2.com

source: Use free email address provider domain blacklist
de_de: Liste freier Emailadressen-Provider Blacklist verwenden

source: The list comprises the most common free email address services. If for example you want to enforce business email addresses, you can activate this blacklist feature and reject email addresses from domains on this list. If you feel that we missed important domains, you can add them on the user-defined domain blacklist above. But please also %1$sinform us%2$s about it. This list is not editable. If you should wonder why we block the entire top-level-domains .cf, .ga, .gq, .mk and .tk, here is why: these top-level-domains are free of charge and therefore wildy popular with private individuals, that don't want to spend anything on a domain. Because of this we treat them like free email address providers. These top-level-domains are almost exclusively registered by individuals and not (relevant) companies.
de_de: Diese Liste umfasst die üblichen freien Emailadressen-Provider. Wenn du beispielsweise die Nutzung geschäftlicher Emailadressen durchsetzen möchtest, kannst du dieses Blacklist-Feature aktivieren und Emailadressen von den gelisteten Domains ablehnen. Wenn du glaubst, dass wir wichtige Domains vergessen haben, kannst du diese in der benutzerdefinierten Blacklist oben ergänzen. Aber %1$sbitte informiere uns%2$s wenn wir wichtige Domains vergessen haben. Falls du dich wundern solltest, warum wir die Top-Level-Domains .cf, .ga, .gq, .mk und .tk blockieren, dann kommt hier das Warum: Diese Top-Level-Domains sind für jedermann kostenlos registrierbar. Aus diesem Grund behandeln wir sie genauso wie Domains freier Emailadressen-Provider. Die Domains dieser Top-Level-Domains werden nahezu ausschließlich von Privatnutzern registriert, jedoch nicht von (relevanten) Firmen.

source: Use email address blacklist
de_de: Emailadressen-Blacklist verwenden

source: Email addresses from this list will be rejected (if active). Unlike with domains and recipient names, you can't use wildcards for email addresses.
de_de: Emailadressen auf dieser Liste werden abgelehnt (wenn aktiviert). Anders als mit Domains und Empfängernamen kannst du für Emailadressen keine Wildcards verwenden.

source: blacklisted-email-address-1@domain.com blacklisted-email-address-2@domain.com
de_de: geblockte-emailaddresse-1@domain.de geblockte-emailaddresse-2@domain.de

source: Use recipient name blacklist
de_de: Empfängernamen Blacklist verwenden

source: If activated, email addresses with recipient names (the part before the "@" sign) from the list below, will be rejected. The recipient names will get automatically "collapsed" to only their letters. This means that non-letter characters get stripped from the original recipient name. "%1$sd.e.m.o.123@domain.com%2$s" gets collapsed into "%1$sdemo@domain.com%2$s". This way, we automatically block role-based recipient names, that are altered with punctuation and non-letter characters. This list is meant for user-defined additional entries that are not (yet) covered by our built-in role-based recipient name blacklist below. Entered recipient names will automatically be stripped of any non-letter (a-z) characters except for wildcards. For information on how to use wildcards, see our %3$sFAQ entry%4$s.
de_de: Wenn aktiviert werden Emailadressen mit Empfängernamen (der Teil einer Emailadresse vor dem "@"-Zeichen) auf der Blacklist abgelehnt. Empfängernamen werden automatisch auf ihre Buchstaben "geschrumpft". Dies bedeutet, dass alle nicht-Buchstaben-Zeichen des Empfängernamens für die Validierung vom Original-Empfängernamen entfernt werden. "%1$sd.e.m.o.123@domain.com%2$s" wird zu "%1$sdemo@domain.com%2$s" umgewandelt. Auf diesem Weg können wir automatisch alle Empfängernamen ausfiltern, die mit Hilfe von Zahlen und Punktion geändert wurden. Diese Liste ist für benutzerdefinierte Einträge vorgesehen, die noch nicht durch unsere eingebautem, Rollen-basierte Empfängernamen-Blacklist weiter unten abgedeckt sind. Für die Verwendung und Syntax von Wildcards, schau dir unseren %3$sFAQ Eintrag%4$s an.

source: blacklisted recipient name 1 blacklisted recipient name 2
de_de: geblockter empfaengername 1 geblockter empfaengername 2

source: Use role-based recipient name blacklist
de_de: Rollenbasierte Empfängernamen-Blacklist verwenden

source: If activated, email addresses with generic, role-based recipient names (the part before the "@" sign) from the list below, will be rejected. The recipient names are validated in their "collapsed" form. This means that all punctuation is stripped from the original recipient name. "%1$si.n.f.o@domain.com%2$s" gets collapsed into "%1$sinfo@domain.com%2$s" (which is on the list). "%1$s123-all-456-employees@domain.com%2$s" gets collapsed into "%1$sallemployees@domain.com%2$s" and so on. Essentially, we strip away all non-letter characters. This way, we can block role-based recipient names, that are altered with punctuation. If the collapsed recipient name is empty, it will also be detected as role-based recipient name. In this case it contains only digits and non-letter characters, which we consider a role-based recipient name. This list is not editable. If you want to block other recipient names than on this list, please use the recipient name blacklist above. If we block too much for you, you can add recipient names to the whitelist above. If you think we missed important common role-based recipient names, %3$splease let us know%4$s.
de_de: Wenn aktiviert werden Emailadressen mit generischen, Rollen-basierten Empfängernamen (der Teil der Emailadresse vor dem "@"-Zeichen) auf der unten stehenden Liste abgelehnt. Die Empfängernamen sind in ihrer "geschrumpften" Form gelistet. "%1$si.n.f.o@domain.com%2$s" wird zu "%1$sinfo@domain.com%2$s" (und "info" ist auf der Liste). "%1$s123-alle-456-angestellten@domain.com%2$s" wird zu "%1$salleangestellten@domain.com%2$s" und so weiter. Im Wesentlichen werden alle Nicht-Buchstaben-Zeichen ausgefiltert. Auf diesem Weg können wir automatisch alle Empfängernamen ausfiltern, die mit Hilfe von Zahlen und Punktion geändert wurden. Diese Liste ist für benutzerdefinierte Einträge vorgesehen, die noch nicht durch unsere eingebautem, Rollen-basierte Empfängernamen-Blacklist weiter unten abedeckt sind. Falls wir mit dieser Liste zu viel ablehnen (false Positives), kannst du diese Empfängernamen auf der oben stehenden Whitelist eintragen. Wenn dir wichtige Rollen-basierte Empfängernamen auf dieser Liste fehlen, %3$ssei so lieb und gib uns Bescheid%4$s.

source: Use disposable email address service (DEA) blacklist
de_de: Wegwerf-Emailadressen-Service Blacklist verwenden

source: If activated email adresses from disposable email address services (DEA) i.e. mailinator.com, maildrop.cc, guerrillamail.com and many more will be rejected. LEAV manages a comprehensive list of DEA services that is frequently updated. We block the underlying MX server domains and IP addresses - not just the website domains. This bulletproofs the validation against domain aliases and makes it extremely reliable, since it attacks DEAs at their core. If you found a DEA service that doesn't get blocked yet, please %1$scontact us%2$s.
de_de: Wenn aktiviert werden Emailadressen von Wegwerf- oder Einmal-Emailadressen-Services wie z.B. mailinator.com, maildrop.cc, guerrillamail.com und viele mehr abgelehnt. LEAV verwaltet eine regelmäßig aktualisierte, umfassende Liste dieser Wegwerf-Emailadress-Services. LEAV blockt nicht nur die Domains der Dienste, sondern auch die Domains und IP-Adressen der zugrunde liegenden Mailserver. Dies macht es überflüssig jeden Domain-Alias der Wegwerf-Emailadress-Services zu pflegen. Alle Domain-Aliase werden automatisch mit geblockt. Dies macht unsere Blacklist sehr zuverlässig und robust. Solltest du einen noch nicht geblockten Wegwerf-Emailadress-Service gefungen haben, bitten wir dich uns %1$shierüber zu informieren%2$s.

source: If activated LEAV tries to simulate the sending of an email. For this we connect to one of the MX servers and test if it would accept an email from your email domain (see above) to the email address that gets validated. If the used email domain doesn't point to your WordPress instance's IP address, this might fail. This is usually only the case in development or test environments. Test this with a working email address. If it gets rejected, you might have to deactivate this option. %1$sThis option should always be active in production environments.%2$s
de_de: Wenn aktiviert versucht LEAV den Versand einer Email zu simulieren. Hierfür wird eine Verbindung zu einem der für die Domain der Emailadresse hinterlegten Mailserver aufgenommen und überprüft, ob der Mailserver die Empfänger-Emailadresse akzeptieren würde. Wenn die hierfür verwendete Email Domain (siehe oben) nicht auf die IP-Adresse deiner WordPress-Instanz zeigt, kann dieser Versuch daran scheitern, dass der Mailserver generell keine Emails von deiner WordPress-Instanz akzeptieren würde. Dies ist üblicherweise nur in Entwicklungs- und Testumgebungen der Fall. Teste es am besten mit einer funktionierenden Emailadresse. Wenn sie abgelehnt wird, musst du eventuell den simulierten Emailversand deaktivieren. %1$sDiese Option sollte in Produktionsumgebungen IMMER aktiviert sein.%2$s

source: Allow catch-all domains
de_de: Erlaube Catch-All Domains

source: Accept email addresses from catch-all domains
de_de: Emailadressen von Catch-All Domains akzeptieren
