Repository: smings/last-email-address-validator
Catalog: languages/last-email-address-validator-*.po
Languages: de_de

source: Of course you know what an email generally looks like. %1$s%1$s%1$s%2$srecipient-name%3$s@%2$sdomain%3$s.%2$stld%3$s But do you really understand its different parts? An email address consists of 3 parts with delimiters in between them.
de_de: Natürlich weißt du wie eine Emailadresse aussieht. %1$s%1$s%1$s%2$sempfaengername%3$s@%2$sdomain%3$s.%2$stld%3$s Aber verstehst du wirklich detailliert, was die unterschiedlichen Teile sind? Eine Emailadresse besteht aus 3 Teilen mit Trennzeichen dazwischen.

source: Recipient name
de_de: Empfängername

source: Let's use a physical world analogy for these elements of an email address. For this, we have to start at the 3rd part of an email address. The %1$stop-level domain%2$s part usually represents a country or an organizational type. And in the beginning of the internet there were aside from some top-level domains like .com, .net, .org, .mil, .edu ...) indeed mostly country domains. Today there are more than 1,500 top-level domains, which gets more and more confusing. But essentially top-level domains are still more or less describing geography, organizational types and more and more lifestyle. There are new top-level domains that are up to 18 charactes long and if you include non-aasci TLDs, they are up to 24 characters long. The current valid list of top-level domains is available at %3$siana.org%4$s. A somewhat current list of how many domains are registered with each top-level domain is available at %5$sdomaintools.com%4$s. For the sake of our analogy, let's pretend top-level domains are describing a type of building i.e. simple houses, company buildings, private mansions, public buildings, condo buildings, appartment buildings etc.. The %1$sdomain%2$s part is the equivalent of a specific building or house of the general type defined by the top-level domain. The house or building has one or multiple mailboxes. Each mailbox represents a real life person, an entire household, a company, a department and so on. A %1$srecipient name%2$s is a name on one of the mailboxes of the house. And there can be multiple names on one mailbox. In this analogy a mailbox is an email account. An email account can have multiple recipient names. Just like a real life mailbox labelled "XYZ family" will receive all mail addressed to any of the XYZ family members, email accounts can have so called aliases. There is usually one "main" or "real" recipient name but additionally there can be "alias" recipient names. For instance companies tend to have a generic main recipient name syntax like this: first.last@company.com Beyond this they tend to also have aliases like f.last@company.com, firstlast@company.com, fl@company.com, first@company, last@company.com etc. You get the picture.
de_de: Lass uns am besten eine Analogie aus der realen Welt betrachten. Hierfür starten wir bei dem 3. Teil einer Emailadresse. Die %1$sTop-Level-Domain%2$s repräsentiert ein Land oder einen Typ Organisationseinheit / Firma. Zu Beginn des Internets gab es (abgesehen von ein paar Top-Level-Domains wie .com, .net, .org, .mil, .edu ...) fast ausschließlich Länder-Top-Level-Domains. Heute gibt es mehr als 1.500 Top-Level-Domains, was alles immer verwirrender macht. Im Wesentlichen beschreiben Top-Level-Domains aber bis zum heutigen Tag überwiegend entweder Länder (.us, .de, .kr, .fr, .it, .jp ...) oder Regionen (.eu), Organisationstypen (.com, .org, .net) und zunehmend auch Lifestyle und Brandnamen. Letztere finden aber im Alltag so gut wie keine relevante Verbreitung. Der Mensch ist ein Gewohnheitstier. Die aktuell gültige Liste aller Top-Level-Domains ist unter %3$siana.org%4$s verfügbar. Eine einigermaßen aktuelle Liste der Anzahl unterhalb der jeweiligen Top-Level-Domains registrierten Domains (und damit der Relevanz der zugehörigen Top-Level-Domain) findest du unter %5$sdomaintools.com%4$s. Um bei unserer Analogie zu bleiben vergleichen wir die Top-Level-Domain mit einer Art oder einem Typ Haus oder Gebäude. Dies können normale Bungalows, Mehrfamilienhäuser, Apartmenthäuser, Hochhäuser, Bürogebäude, Fabrikhallen und so weiter sein. Die %1$sDomain%2$s ist in dieser Analogie ein konkretes Gebäude oder Haus. Jeder Briefkasten bzw. Briefschlitz an dem Gebäude oder Haus ist repräsentiert einen Haushalt, eine Abteilung oder eine einzelne Person. An jedem Briefkasten können mehrere Namen stehen. Der %1$sEmpfängername%2$s der Emailadresse entspricht einem Namen auf einem Briefkasten. Ein Briefkasten entspricht einem Emailkonto. Im echten Leben wird ein Postbote die gesamte Post für Familie XYZ in den Briefkasten, mit dem Namen XYZ einwerfen. Egal ob der Brief an Tim XYZ, Jens XYZ oder Jane XYZ addressiert ist. Emailkonten können Aliases haben, die ganz ähnlich funktionieren. Es gibt üblicherweise einen Haupt-Email-Empfängernamen und eine beliebig große Anzahl von Aliasen pro Emailkonto.Die allermeisten Geschäftsemailadressen haben z.B. das Haupt-Email-Konto vorname.nachname@firma.de. Darüber hinaus haben die allermeisten aber auch die folgenden Aliase: v.nachname@firma.de, nachname@firma.de, vn@firma.de und manchmal bei sehr kleinen Firmen sogar vorname@firma.de. Und natürlich hat jeder Firmenmitarbeiter nur ein Emailkonto für all diese Aliase.

source: What is a "recipient name":
de_de: Was ist ein "Empfängername":

source: A Recipient name is the part of an email that is in front of the "@" sign. It is also called "local part". This part defines the concrete mailbox an email gets received by. The mailbox might also be reachable under aliases for the "main" recipient name.
de_de: Ein Empfängername ist der Teil der Emailadresse vor dem "@"-Zeichen. Auf Englisch wird er auch "local part" genannt. Der Empfängername definiert das Emailkonto an den eine Email geliefert wird. Ein Emailkonto kann auch unter Aliasen des Haupt-Empfängernamens erreicht werden.

source: What does "recipient name catch-all syntax" mean?
de_de: Was bedeutet "Empfängernamen-Catch-All-Syntax"?

source: Email address service providers like %1$sgmail.com%2$s and others allow users to place a "+" sign after their actual recipient name and append whatever string they want as long as the recipient name's total length doesn't exceed 64 characters. If your email address is "%1$stester.testing@gmail.com%2$s" you are allowed to use the following email addresses as well and they will all be delivered into your mailbox: "%1$stester.testing+domain1@gmail.com%2$s", "%1$stester.testing+newsletter.xyz@gmail.com%2$s", "%1$stester.testing+website.signup.for.lottery@gmail.com%2$s" etc. This is a very easy way for users to differentiate between where and what they signed up for or subscribed to. This allows users to "cloak" their "main" email address. Well - at least a tiny bit. This gives users an infinite amount of email addresses, which sometimes makes it easy for leechers to sign up to free or freemium offers multiple times. You might wan't to disallow this, if it interferes with your business model
de_de: Emailadress Service Provider wie zum Beispiel %1$sgmail.com%2$s und andere erlauben es Benutzern hinter ihrem regulären Empfängernamen ein "+"-Zeichen gefolgt von beliebigen Zeichen zu benutzen. Dies ist nur limitiert durch die maximale Empfängernamenlänge von 64 Zeichen. Wenn deine Emailadresse beispielsweise %1$svorname.nachname@gmail.com%2$s ist, so darfst du auch folgende Kombinationen nutzen und alle Emails an diese Emailadressen landen dennoch in deinem Postfach: "%1$svorname.nachname+domain1@gmail.com%2$s>", "%1$svorname.nachname+newsletter.xyz@gmail.com%2$s", "%1$svorname.nachname+website.teilname.an.gewinnspirl@gmail.com%2$s" etc. Dies ermöglicht es Benutzern sehr einfach ihre Hauptemailadresse zu "verschleiern". Zumindest ein kleines bisschen. Es ermöglicht Benutzern vor allem sehr einfach zwischen unterschiedlichen Einsatzszenarien ihrer Emailadresse zu unterscheiden. Dies macht es Schnorrern sehr einfach sich z.B. für Freemium-Registrierungen beliebig häufig anzumelden. Eventuell möchtest du dies jedoch wegen deines Geschäftsmodells oder aus anderen Gründen unterdrücken. Hierfür kannst du die Empfängernamen-Catch-All-Syntax einfach verbieten

source: If you look for more supported plugins or an extension of the base functionality of how we validate and filter email addresses, we at %1$ssmings%2$s (website will be online soon) are always happy to optimize LEAV - Last Email Address Validator to help you to protect your non-renewable lifetime even better. Just shoot us an email to %3$s
de_de: Wenn du ein bislang noch nicht unterstütztes Plugin verwendest oder Ideen für eine noch bessere Filterung und Validierung von Emailadressen hast, dann melde dich bei uns. Wir bei %1$ssmings%2$s (die Website ist bald verfügbar) freuen uns immer LEAV - Last Email Address Validator noch besser zu machen, um dir dabei zu helfen, deine nicht-erneuerbare Lebenszeit noch besser zu schützen. Schick uns einfach eine Email an %3$s

source: Help us help you!
de_de: Hilf uns Dir zu helfen!

source: Lastly - if LEAV - Last Email Address Validator delivers substancial value to you, i.e. saving lots of your precious non-renewable lifetime by filtering out tons of spam attempts, please show us your appreciation and consider a %1$s%3$sone-time donation%4$s%2$s or become a patreon on our patreon page at %1$s%5$spatreon.com/smings%4$s%2$s We appreciate your support and send you virtual hugs and good karma points. Thank you and enjoy LEAV
de_de: Zu guter Letzt - wenn LEAV - Last Email Address Validator fundamentalen Mehrwert für dich schafft in dem es dir eine Menge deiner wertvollen, nicht erneuerbaren Lebenszeit bewahrt, in dem es Tonnen von Spamversuchen verhindert, dann zeige uns bitte deine Wertschätzung und erwäge eine %1$s%3$seinmalige Spende%4$s%2$s oder werde ein Patreon auf unserer Patreon-Seite unter %1$s%5$spatreon.com/smings%4$s%2$s Wir danken dir vielmals für dein Vertrauen und deine Unterstützung und senden dir virtuelle Umarmungen und gutes Karma. Danke dir und viel Spass mit LEAV

source: Statistics
de_de: Statistik

source: LEAV prevented %1$s%3$s%2$s SPAM email address attempts so far.
de_de: LEAV hat bislang %1$s%3$s%2$s SPAM Emailadress-Eingaben abgewehrt.

source: Documentation
de_de: Dokumentation

source: Bugs
de_de: Fehler (Bugs)

source: Both will be available soon.
de_de: Beide sind bald verfügbar.

source: # The value on the next line was automatically corrected/normalized
de_de: # Der Wert der nächsten Zeile wurde automatisch korrigiert / normalisiert

source: # The value on the next line is invalid
de_de: # Der Eintrag auf der nächsten Zeile ist ungültig

source: Updated the settings for
de_de: Aktualisierung der Einstellungen für

source: allowing recipient name catch-all syntax.
de_de: Empfängernamen-Carch-All-Syntax erlauben.

source: Updated the email domain for simulating the sending of emails.
de_de: Aktualisierung der Email Domain für das simulierte Versenden von Emails.

source: using the user-defined domain whitelist.
de_de: die Nutzung der benutzerdefinierten Domain-Whitelist.

source: Updated the user-defined domain whitelist.
de_de: Aktualisierung der benutzerdefinierten Domain-Whitelist.

source: using the user-defined email address whitelist.
de_de: die Nutzung der benutzerdefinierten Emailadressen-Whitelist.

source: Updated the user-defined email address whitelist.
de_de: Aktualisierung der benutzerdefinierten Emailadressen-Whitelist.

source: using the user-defined recipient name whitelist.
de_de: die Nutzung der benutzerdefinierten Empfängernamen-Whitelist.

source: Updated the user-defined recipient name whitelist.
de_de: Aktualisierung der benutzerdefinierten Empfängernamen-Whitelist.

source: using the user-defined domain blacklist.
de_de: die Nutzung der benutzerdefinierten Domain-Blacklist.

source: Updated the user-defined domain blacklist.
de_de: Aktualisierung der benutzerdefinierten Domain-Blacklist.

source: using the built-in blacklist of free email address providers.
de_de: dir Nutzung der eingebauten Blacklist freier Emailadressen Provider.

source: using the user-defined email address blacklist.
de_de: die Nutzung der benutzerdefinierten Emailadressen-Blacklist.

source: Updated the user-defined email address blacklist.
de_de: Aktualisierung der benutzerdefinierten Emailadressen-Blacklist.

source: using the user-defined recipient name blacklist.
de_de: die Nutzung der benutzerdefinierten Empfängernamen-Blacklist.

source: Updated the entries of the user-defined recipient name blacklist.
de_de: Aktualisierung der benutzerdefinierten Empfängernamen-Blacklist.

source: using the role-based recipient name blacklist.
de_de: die Nutzung der rollenbasierten Empfängernamen-Blacklist.

source: blocking email addresses from disposable email address services.
de_de: das Blockieren von Wegwerf-Emailadressen.

source: simulating email sending.
de_de: den simulierten Emailversand.

source: allowing catch-all domains.
de_de: die Verwendung von Catch-All-Domains.

source: accepting pingbacks.
de_de: Pingbacks akzeptieren.

source: accepting trackbacks.
de_de: Trackbacks akzeptieren.

source: validating WordPress's user registration email addresses.
de_de: die WordPress Benutzerregistrierung Emailadressen-Validierung.

source: validating WordPress's commentator email addresses.
de_de: die WordPress Kommentar Emailadressen-Validierung.

source: validating WooCommerce email fields.
de_de: die WooCommerce Emailadress-Feld-Validierung.

source: validating Contact Form 7 email fields.
de_de: die Contact Form 7 Emailadress-Feld-Validierung.

source: validating WPforms email fields.
de_de: die WPForms Emailadress-Feld-Validierung.

source: validating Ninja Forms email fields.
de_de: die Ninja Forms Emailadress-Feld-Validierung.

source: validating Mailchimp for WordPress (MC4WP) email fields.
de_de: die Mailchimp for WordPress (MC4WP)-Emailadress-Feld-Validierung.

source: validating Formidable Forms email fields.
de_de: die Formidable Forms Emailadress-Feld-Validierung.

source: validating Kali Forms email fields.
de_de: die Kali Forms Emailadress-Feld-Validierung.

source: Updated the custom validation error message for
de_de: Aktualisierung der benutzerdefinierten Fehlermeldung für

source: email address contains invalid characters errors.
de_de: Emailadresse enthält ungültige Zeichen fehler.

source: email address syntax errors.
de_de: Emailadress-Syntaxfehler.

source: recipient name catch-all errors.
de_de: Empfängernamen-Carch-All-Syntax Fehler.

source: blacklisted email domains.
de_de: geblockte Email-Domains.

source: email domains on the free email address provider domain list.
de_de: Email Domains auf der Liste kostenloser Emailadressen-Provider.

source: blacklisted email addresses.
de_de: geblockte Emailadressen.

source: recipient name is on blacklist error message.
de_de: Empfängername ist auf der Blacklisted Fehlermeldung.

source: role-based recipient names.
de_de: rollenbasierte Empfängernamen.

source: email domains without MX records.
de_de: Email-Domains ohne MX Einträge.

source: disposable email addresses (DEA).
de_de: Wegwerf-Emailadressen.

source: errors during simulating sending an email.
de_de: Fehler während des simulierten Emailversands.

source: email addresses from catch-all domains.
de_de: Emailadressen von Catch-All Domains.

source: general email validation errors.
de_de: Allgemeiner Emailadress Validierungsfehler.

source: Changed the display location of the LEAV menu item. You have to hard-reload this page before the change takes effect.
de_de: Die Anzeigeposition des LEAV Menüeintrags wurde aktualisiert. Um diese Änderung sichtbar zu machen, muss du diese Seite neu laden.

source: Updated the settings for field
de_de: Aktualisierung der Einstellungen für das Feld

source: Error while trying to update the settings for
de_de: Fehler beim Versuch der Aktualisierung der Einstellungen für

source: Error while trying to update the email domain for the simulated sending of emails. The email domain can't be empty while simulated email sending is active.
de_de: Fehler bei der Aktualisierung der Einstellungen für die Email Domain für das simulierte Versenden von Emails. Die Email Domain darf nicht leer sein, solange das simulierte Versenden von Emails aktiv ist.

source: Error while trying to update the email domain for the simulated sending of emails. The entered value "
de_de: Fehler bei der Aktualisierung der Einstellungen für die Email Domain für das simulierte Versenden von Emails. Die Email Domain darf nicht leer sein, solange das simulierte Versenden von Emails aktiv ist.

source: Error! One or more entered domains in the user-defined domain whitelist are invalid. Look at the comments in the field and correct your input.
de_de: Fehler! Eine oder mehrere eingegebene Domains in der benutzerdefinierten Domain-Whitelist sind ungültig. Schau Dir die Kommentare im Eingabefeld an und korrigiere Deine Eingaben.

source: Error! One or more entered email addresses in the user-defined email address whitelist are invalid. Look at the comments in the field and correct your input.
de_de: Fehler! Eine oder mehrere eingegebene Emailadressen in der benutzerdefinierten Emailaddress-Whitelist sind ungültig. Schau Dir die Kommentare im Eingabefeld an und korrigiere Deine Eingaben.

source: Error! One or more entered recipient names in the user-defined recipient name whitelist are invalid. Look at the comments in the field and correct your input.
de_de: Fehler! Einer oder mehrere eingegebene Empfängernamen in der benutzerdefinierten Empfängernamen-Whitelist sind ungültig. Schau Dir die Kommentare im Eingabefeld an und korrigiere Deine Eingaben.

source: Error! One or more entered domains in the user-defined domain blacklist are invalid. Look at the comments in the field and correct your input.
de_de: Fehler! Eine oder mehrere eingegebene Domains in der benutzerdefinierten Domain-Blacklist sind ungültig. Schau Dir die Kommentare im Eingabefeld an und korrigiere Deine Eingaben.

source: Error! One or more entered email addresses in the user-defined email address blacklist are invalid. Look at the comments in the field and correct your input.
de_de: Fehler! Eine oder mehrere eingegebene Emailadressen in der benutzerdefinierten Emailadress-Blacklist sind ungültig. Schau Dir die Kommentare im Eingabefeld an und korrigiere Deine Eingaben.

source: Error while trying to update the entries of the user-defined recipient name blacklist.
de_de: Fehler während der Aktualisierung Eingaben für die benutzerdefinierte Empfängernamen-Blacklist.

source: simulated email sending.
de_de: den simulierten Emailversand.

source: the display location of the LEAV menu item (main menu or settings menu.
de_de: die LEAV Menüposition (Haupt- oder Einstellungen-Menü).

source: Error! The values for the LEAV menu position within the main menu or the settings menu have to be numbers in between 0-999.
de_de: Fehler! Die Werte für die Position des LEAV Menüeintrags im Haupt- oder Einstellungen-Menü muss eine Zahl zwischen 0-999 sein.

source: Error while trying to update the settings for field
de_de: Fehler beim Versuch der Aktualisierung der Einstellungen für

source: Error:
de_de: Fehler:
